In [146]:
people = ['Dr. Christopher Brooks', 'Dr. Kevyn Collins-Thompson', 'Dr. VG Vinod Vydiswaran', 
         'Dr. Daniel Romero']

def split_title_and_name(person):
    return person.split()[0] + ' ' + person.split()[-1]

#option 1
for person in people:
    print(split_title_and_name(person) == (lambda x: x.split()[0] + ' ' + x.split()[-1])
          (person))

#option 2
list(map(split_title_and_name, people)) == list(map(lambda person: person.split()[0] + ' ' + 
                                                    person.split()[-1], people))

True
True
True
True

True

In [147]:
dummy_function = lambda a,b,c:a+b

In [148]:
dummy_function(1,2,3)

3

In [149]:
dummy_function(10,22,37)

32

let's pause this course for a moment - don't you think its going a bit too fast
without any good examples? that example was so confusing, don't know why they created it
A lambda function is a small anonymous function.
A lambda function can take any number of arguments, but can only have one expression.

# Lambda

## variable_name = lambda_keyword argument_or_list_of_inputs : expression_or_return_result

In [150]:
#first let's define a normal function
def multiply(a,b):
    return a*b

multiply(5,6)

30

In [151]:
#now let's use lambda
multiply_using_lambda = lambda a,b : a*b

multiply_using_lambda(5,6)

30

In [152]:
multiply_using_lambda

In [153]:
#define a lambda function that returns square of a value
square = lambda a : a*a

square(5)

25

In [154]:
#get 3 values and return a list

list_lambda = lambda a,b,c : [a,b,c]
    
list_lambda('apple',2,3)

['apple', 2, 3]

In [155]:
#get a string and return the first character of a string

return_first_character = lambda input_string : input_string[0]

return_first_character('hello')

'h'

In [156]:
#return length

return_length = lambda input_string : len(input_string)

return_length('Good Morning')

12

# lambda using lists

In [157]:
#create a function to get a list and square the items in it 

number_list = [1,2,3,4,5]

def square_list(input_list):
    squared_list = []
    for item in input_list:
        square = item * item
        squared_list.append(square)
    return squared_list

square_list(number_list)

[1, 4, 9, 16, 25]

In [158]:
#use map
#map syntax:
#map(function,list)

def square_numbers(item):
    return item * item

map(square_numbers,number_list)

#convert map object to a list
list(map(square_numbers,number_list))

[1, 4, 9, 16, 25]

In [159]:
#use lambda

square_lambda = lambda item : item * item

list(map(square_lambda,number_list))

[1, 4, 9, 16, 25]

In [160]:
#making it compact ie, get rid of the function and put lambda inside map

list(map(lambda item : item * item , number_list))

[1, 4, 9, 16, 25]

In [161]:
#convert a list of words to upper case
breakfast_menu = ['tea','coffee','biscuits']

list(map(lambda element : element.upper(), breakfast_menu))

['TEA', 'COFFEE', 'BISCUITS']

In [162]:
#converst list of sentences to lower case
sentences = ['I had breakfast','I am having lunch','I will have dinner']

list(map(lambda sentence : sentence.lower(),sentences))

['i had breakfast', 'i am having lunch', 'i will have dinner']

# Lambda with conditions

In [163]:
#a function that returns true if value is even, false if odd
def odd_even(number):
    if (number%2==0):
        return True
    else:
        return False
    
odd_even(4)

True

In [164]:
odd_even(5)

False

In [165]:
#use lambda
odd_even_lambda = lambda number : True if number%2 == 0 else False

odd_even_lambda(6)

True

In [166]:
odd_even_lambda(7)

False

In [167]:
#normal function - filter out even numbers from a list
numbers = [12,23,34,45,56,67,78,89,90]

def filter_even(numbers_list):
    even_numbers = []
    for number in numbers_list:
        if(number%2==0):
            even_numbers.append(number)
    return even_numbers

filter_even(numbers)

[12, 34, 56, 78, 90]

In [168]:
#using filter function
#syntax - filter(function_name,list of objects) -> returns the items for which function 
#returned true
#filter can iterate through the list of objects like map
#see the example using lambda for this

#just recreate our old function
def odd_even(number):
    if (number%2==0):
        return True
    else:
        return False

In [169]:
filter(odd_even,numbers)

In [170]:
#convert the filter object to list ie, cast it
list(filter(odd_even,numbers))

[12, 34, 56, 78, 90]

In [171]:
#how about using our old lambda
#use lambda
odd_even_lambda = lambda number : True if number%2 == 0 else False

In [172]:
list(filter(odd_even_lambda,numbers))

[12, 34, 56, 78, 90]

In [173]:
list(filter(lambda number : True if number%2 == 0 else False,numbers))

[12, 34, 56, 78, 90]

In [174]:
#filter out the names starting with 'S'
names = ['Vivaan','Aarav','Krishna','Shazin','Indhu','Shiyon','Liyon','Niyon','Shilna','Kiran']

list(filter(lambda name : True if name[0]=='S' else False,names))

['Shazin', 'Shiyon', 'Shilna']

In [175]:
#names starting with K but with length 5


list(filter(lambda name : True if (name[0]=='K') and (len(name)==5) else False,names))

['Kiran']

In [176]:
#mulitply odd by 10 and even by 100
list(map(lambda number: number*100 if number%2==0 else number*10,numbers))

[1200, 230, 3400, 450, 5600, 670, 7800, 890, 9000]

# Lambda and sorting

In [177]:
#a list of objects that contains products as tuples
products = [('Carrot',2),('Apple',10),('Egg',12),('Banana',5),('Dry Fruits',20)]

#sort it alphabetically
products.sort()
products

[('Apple', 10), ('Banana', 5), ('Carrot', 2), ('Dry Fruits', 20), ('Egg', 12)]

In [178]:
#using lambda - sort by price
products.sort(key = lambda item : item[1])

products

[('Carrot', 2), ('Banana', 5), ('Apple', 10), ('Egg', 12), ('Dry Fruits', 20)]

In [179]:
# a list of dictionaries
employees = [
                {"name":"Charles","Age": 34,"Income":30000},
                {"name":"Alex","Age":25 ,"Income":50000},
                {"name":"Emily","Age": 45,"Income":10000},
                {"name":"Ben","Age": 23,"Income":40000},
                {"name":"Dick","Age":33 ,"Income":20000},
            ]
employees

[{'name': 'Charles', 'Age': 34, 'Income': 30000},
 {'name': 'Alex', 'Age': 25, 'Income': 50000},
 {'name': 'Emily', 'Age': 45, 'Income': 10000},
 {'name': 'Ben', 'Age': 23, 'Income': 40000},
 {'name': 'Dick', 'Age': 33, 'Income': 20000}]

In [180]:
#sort by name
#employees.sort()-gives error

employees.sort(key = lambda person : person["name"])
employees

[{'name': 'Alex', 'Age': 25, 'Income': 50000},
 {'name': 'Ben', 'Age': 23, 'Income': 40000},
 {'name': 'Charles', 'Age': 34, 'Income': 30000},
 {'name': 'Dick', 'Age': 33, 'Income': 20000},
 {'name': 'Emily', 'Age': 45, 'Income': 10000}]

In [181]:
#based on income
employees.sort(key = lambda person : person["Income"])
employees

[{'name': 'Emily', 'Age': 45, 'Income': 10000},
 {'name': 'Dick', 'Age': 33, 'Income': 20000},
 {'name': 'Charles', 'Age': 34, 'Income': 30000},
 {'name': 'Ben', 'Age': 23, 'Income': 40000},
 {'name': 'Alex', 'Age': 25, 'Income': 50000}]

# Data Manipulation

In [182]:
import pandas as pd

In [183]:
dataframe = pd.DataFrame({
    'Name':['Alex','Ben','Charles','Dick','Emily'],
    'Hourly Wage':[30,10,40,20,50],
    'Contract Type':['Full Time','Part Time','Full Time','Full Time','Part Time']
})

In [184]:
dataframe

      Name  Hourly Wage Contract Type
0     Alex           30     Full Time
1      Ben           10     Part Time
2  Charles           40     Full Time
3     Dick           20     Full Time
4    Emily           50     Part Time

In [185]:
#create a colum daily working hours based on the assumption that
#full time = 40 hours, part time = 20 hours per week
#using lambda

dataframe["Contract Type"]

0    Full Time
1    Part Time
2    Full Time
3    Full Time
4    Part Time
Name: Contract Type, dtype: object

In [186]:
#using apply function with lambda
dataframe["Contract Type"].apply(lambda type : 4 if type =="Part Time" else 8)

0    8
1    4
2    8
3    8
4    4
Name: Contract Type, dtype: int64

In [187]:
#now add this as a column
dataframe["Daily Working Hours"] = dataframe["Contract Type"].apply(
    lambda type : 4 if type =="Part Time" else 8)

dataframe

      Name  Hourly Wage Contract Type  Daily Working Hours
0     Alex           30     Full Time                    8
1      Ben           10     Part Time                    4
2  Charles           40     Full Time                    8
3     Dick           20     Full Time                    8
4    Emily           50     Part Time                    4

In [188]:
#calculate annual income - this is just copying what we did above
#dataframe["Annual Income"] = dataframe["Hourly Wage"].apply(lambda wage : float(wage) * 12 )
#dataframe

In [193]:
#using row of apply property
dataframe["Annual Income"] = dataframe.apply(
    lambda row : row["Daily Working Hours"] * row["Hourly Wage"] * 365, axis = 1)
dataframe

      Name  Hourly Wage Contract Type  Daily Working Hours  Annual Income
0     Alex           30     Full Time                    8          87600
1      Ben           10     Part Time                    4          14600
2  Charles           40     Full Time                    8         116800
3     Dick           20     Full Time                    8          58400
4    Emily           50     Part Time                    4          73000

In [199]:
#axis = 0 means apply this along colum
#axis = 1 means apply this along rows

#exercise - calculate tax
#if agove 75000 tax is 10%
#below that is 0%

dataframe["Annual Tax"] = dataframe.apply(
    lambda row : row["Annual Income"]*0.01 if row["Annual Income"] > 75000 else 0, axis = 1)
dataframe

,Name,Hourly Wage,Contract Type,Daily Working Hours,Annual Income,Annual Tax
0,Alex,30,Full Time,8,87600,876.0
1,Ben,10,Part Time,4,14600,0.0
2,Charles,40,Full Time,8,116800,1168.0
3,Dick,20,Full Time,8,58400,0.0
4,Emily,50,Part Time,4,73000,0.0